[
  {
    "title": "Deliciously Moist Chocolate Layer Cake",
    "slug": "triple-chocolate-layer-cake",
    "rating": 4.9,
    "num_reviews": 902,
    "link": "https://sallysbakingaddiction.com/triple-chocolate-layer-cake/",
    "images": [
      "https://sallysbakingaddiction.com/wp-content/uploads/2013/04/triple-chocolate-cake-4.jpg",
      "https://sallysbakingaddiction.com/wp-content/uploads/2013/04/triple-chocolate-cake-3.jpg",
      "https://sallysbakingaddiction.com/wp-content/uploads/2013/04/triple-chocolate-cake.jpg",
      "https://sallysbakingaddiction.com/wp-content/uploads/2019/08/dark-chocolate-cake-batter.jpg",
      "https://sallysbakingaddiction.com/wp-content/uploads/2013/04/triple-chocolate-cake-2.jpg",
      "https://sallysbakingaddiction.com/wp-content/uploads/2019/05/chocolate-frosting-in-glass-bowl.jpg",
      "https://sallysbakingaddiction.com/wp-content/uploads/2013/04/triple-chocolate-cake-5.jpg",
      "https://sallysbakingaddiction.com/wp-content/uploads/2013/04/triple-chocolate-cake-4-265x265.jpg"
    ],
    "prep_time": "30 minutes",
    "cook_time": "25 minutes",
    "total_time": "4 hours",
    "serves": "serves 12-16",
    "description": "This is my favorite homemade chocolate cake recipe. With a super moist crumb and fudgy, yet light texture, this chocolate cake recipe will be your favorite too. Top with chocolate buttercream and chocolate chips for 3x the chocolate flavor. You can also prepare this chocolate layer cake as a sheet cake. See recipe Note.",
    "ingredients": [
      "1 and 3/4 cups (219g) all-purpose flour (spooned & leveled)",
      "3/4 cup (62g) unsweetened natural cocoa powder",
      "1 and 3/4 cups (350g) granulated sugar",
      "2 teaspoons baking soda",
      "1 teaspoon baking powder",
      "1 teaspoon salt",
      "2 teaspoons espresso powder (optional)",
      "1/2 cup (120ml) vegetable oil (or canola oil or melted coconut oil)",
      "2 large eggs, at room temperature",
      "2 teaspoons pure vanilla extract",
      "1 cup (240ml) buttermilk, at room temperature",
      "1 cup (240ml) freshly brewed strong hot coffee (regular or decaf)",
      "1 and 1/4 cups (2.5 sticks or 290g) unsalted butter, softened to room temperature",
      "3 and 1/2 cups (420g) confectioners’ sugar",
      "3/4 cup (65g) unsweetened cocoa powder (natural or dutch process)",
      "3–5 Tablespoons (45-75ml) heavy cream (or half-and-half or milk), at room temperature",
      "1/4 teaspoon salt",
      "1 teaspoon pure vanilla extract",
      "optional for decoration: semi-sweet chocolate chips"
    ],
    "instructions": [
      "Preheat oven to 350°F (177°C). Grease two 9-inch cake pans, line with parchment paper rounds, then grease the parchment paper. Parchment paper helps the cakes seamlessly release from the pans. (If it’s helpful, see this parchment paper rounds for cakes video & post.)",
      "Make the cake: Whisk the flour, cocoa powder, sugar, baking soda, baking powder, salt, and espresso powder (if using) together in a large bowl. Set aside. Using a handheld or stand mixer fitted with a whisk attachment (or you can use a whisk) mix the oil, eggs, and vanilla together on medium-high speed until combined. Add the buttermilk and mix until combined. Pour the wet ingredients into the dry ingredients, add the hot water/coffee, and whisk or beat on low speed until the batter is completely combined. Batter is thin.",
      "Divide batter evenly between pans. Bake for 23-26 minutes or until a toothpick inserted in the center comes out clean. Baking times vary, so keep an eye on yours. The cakes are done when a toothpick inserted in the center comes out clean. (Note: Even if they’re completely done, the cooled cakes may *slightly* sink in the center. Cocoa powder is simply not as structurally strong as all-purpose flour and can’t hold up to all the moisture necessary to make a moist tasting chocolate cake. It’s normal!)",
      "Remove the cakes from the oven and set on a wire rack. Allow to cool completely in the pan.",
      "Make the buttercream: With a handheld or stand mixer fitted with a paddle attachment, beat the butter on medium speed until creamy – about 2 minutes. Add confectioners’ sugar, cocoa powder, 3 Tablespoons heavy cream, salt, and vanilla extract. Beat on low speed for 30 seconds, then increase to high speed and beat for 1 full minute. Do not over-whip. Add 1/4 cup more confectioners’ sugar or cocoa powder if frosting is too thin or 1-2 more Tablespoons of cream if frosting is too thick. (I usually add 1 more.) Taste. Add another pinch of salt if desired.",
      "Assemble and frost: If cooled cakes are domed on top, use a large serrated knife to slice a thin layer off the tops to create a flat surface. This is called “leveling” the cakes. Discard or crumble over finished cake. Place 1 cake layer on your cake stand or serving plate. Evenly cover the top with frosting. Top with 2nd layer and spread remaining frosting all over the top and sides. I always use an icing spatula and bench scraper for the frosting. Garnish with chocolate chips, if desired.",
      "Refrigerate uncovered cake for at least 30-60 minutes before slicing to help set the shape. After that, you can serve the cake or continue refrigerating for up to 4–6 hours before serving. Cake can be served at room temperature or chilled.",
      "Cover leftover cake tightly and store in the refrigerator for 5 days. I like using a cake carrier for storing and transporting."
    ],
    "notes": [
      "Make Ahead & Freezing Instructions: Prepare cake through step 4. Wrap the individual baked and cooled cake layers tightly and refrigerate for up to 2 days or freeze up to 3 months. Bring to room temperature then continue with step 5. You can prepare the chocolate buttercream 2-3 days in advance. Cover and refrigerate, then bring to room temperature before spreading onto/assembling the cake. Frosted cake freezes well, up to 3 months. Thaw overnight in the refrigerator, then bring to room temperature or serve cold.",
      "Special Tools (affiliate links): 9-Inch Cake Pans | Electric Mixer (Handheld or Stand Mixer) | Glass Mixing Bowls | Whisk | Cake Stand, Serving Plate, or Cake Turntable | Icing Spatula | Bench Scraper | Cake Carrier (for storing)",
      "3 Layer Cake: You can also prepare this cake as a 3 layer cake. Divide batter between three 8-inch or 9-inch cake pans in step 1 and bake for 22-25 minutes or until a toothpick inserted in the center comes out clean. This frosting will be enough for 3 layers. If desired, use the frosting recipe from my Piñata Cake if you want extra frosting.",
      "Cocoa Powder: Use natural cocoa powder in the cake, not dutch-process. (See dutch-process vs natural cocoa powder for more information.) Since there is no leavening occurring in frosting, you can use either natural or dutch-process in the chocolate buttercream.",
      "Buttermilk: Buttermilk is required for this recipe. You can make your own DIY version of buttermilk if needed. Add 2 teaspoons of white vinegar or lemon juice to a liquid measuring cup. Then add enough room temperature whole milk to the same measuring cup until it reaches 1 cup. (In a pinch, lower fat or nondairy milks work for this soured milk, but the cake won’t taste as moist or rich.) Stir it around and let sit for 5 minutes. The homemade “buttermilk” will be somewhat curdled and ready to use in the recipe.",
      "Sour Cream Version: Lately I’ve been using a mix of sour cream and buttermilk, as well as reducing the hot coffee. Reduce the buttermilk and hot coffee to 1/2 cup (120ml) each. Add 3/4 cup (180g) of room temperature full-fat sour cream with the wet ingredients. You can see this described above, in the video tutorial, and in my dark chocolate mousse cake. That cake and this cake are both fantastically moist, but the sour cream version has a slightly sturdier crumb.",
      "FAQ: The sour cream version (note above) makes a sturdy enough cake that will hold under fondant.",
      "Amount of Cake Batter: This recipe (and the sour cream version) yields about 6 cups of batter, which is helpful if you need it for different Cake Pan Sizes & Conversions.",
      "Room Temperature Ingredients: All refrigerated items should be at room temperature so the batter mixes together easily and evenly. Read more about why room temperature ingredients are important.",
      "Espresso Powder/Coffee: Espresso powder and coffee will not make the cake taste like coffee. Instead, they deepen the chocolate flavor. I highly recommend them both. You can use the same amount of instant coffee (the powder) instead of espresso powder if desired. If coffee isn’t your thing, you can leave out the espresso powder and use extra hot water or hot chai tea.",
      "Bundt Pan: I recommend my chocolate cream cheese bundt cake but without the cream cheese filling. Reduce buttermilk in that recipe to 1/4 cup and increase sour cream to 1 cup.",
      "9×13 Inch Pan: You can bake this cake in a 9×13-inch baking pan. Same oven temperature, about 35-40 minutes bake time.",
      "Chocolate Cupcakes: Here is my favorite chocolate cupcakes recipe. Same unbelievable texture as this cake! (You’ll notice I don’t use hot liquid in that recipe. That’s because there isn’t the same volume of dry ingredients to break up. If you need more than 1 dozen chocolate cupcakes, use this chocolate cake recipe for 2-3 dozen. Same baking instructions as my chocolate cupcakes."
    ]
  },
  {
    "title": "Homemade Strawberry Cake",
    "slug": "strawberry-cake",
    "rating": 4.8,
    "num_reviews": 552,
    "link": "https://sallysbakingaddiction.com/strawberry-cake/",
    "images": [
      "https://sallysbakingaddiction.com/wp-content/uploads/2017/12/homemade-strawberry-cake-4.jpg",
      "https://sallysbakingaddiction.com/wp-content/uploads/2017/12/homemade-strawberry-cake.jpg",
      "https://sallysbakingaddiction.com/wp-content/uploads/2017/12/homemade-strawberry-cake-6.jpg",
      "https://sallysbakingaddiction.com/wp-content/uploads/2017/12/homemade-strawberry-cake-7.jpg",
      "https://sallysbakingaddiction.com/wp-content/uploads/2017/12/homemade-strawberry-cake-8.jpg",
      "https://sallysbakingaddiction.com/wp-content/uploads/2017/12/homemade-strawberry-cake-10.jpg",
      "https://sallysbakingaddiction.com/wp-content/uploads/2017/12/homemade-strawberry-cake-9.jpg",
      "https://sallysbakingaddiction.com/wp-content/uploads/2017/12/homemade-strawberry-cake-3.jpg",
      "https://sallysbakingaddiction.com/wp-content/uploads/2017/12/homemade-strawberry-cake-4-265x265.jpg"
    ],
    "prep_time": "1 hour, 30 minutes",
    "cook_time": "25 minutes",
    "total_time": "6 hours",
    "serves": "serves 10-12",
    "description": "The one thing that sets this strawberry cake apart from others? Reduce fresh strawberry puree down and add to the best white cake batter.",
    "ingredients": [
      "1 pound (454g) fresh strawberries, rinsed and hulled",
      "2 and 1/2 cups (285g) cake flour (spooned & leveled)",
      "2 teaspoons baking powder",
      "1/2 teaspoon baking soda",
      "1 teaspoon salt",
      "3/4 cup (12 Tbsp; 170g) unsalted butter, softened to room temperature",
      "1 and 3/4 cups (350g) granulated sugar",
      "5 large egg whites, at room temperature",
      "1/3 cup (75g) sour cream or plain yogurt, at room temperature",
      "2 teaspoons pure vanilla extract",
      "1/2 cup (120ml) whole milk, at room temperature*",
      "1/2 cup reduced strawberry puree (see step 1)",
      "optional: 1–2 drops red or pink food coloring",
      "1 cup (about 25g) freeze-dried strawberries*",
      "8 ounces (226g) full-fat brick cream cheese, softened to room temperature",
      "1/2 cup (8 Tbsp; 113g) unsalted butter, softened to room temperature",
      "3 cups (360g) confectioners’ sugar",
      "1–2 Tablespoons milk",
      "1 teaspoon pure vanilla extract",
      "salt, to taste"
    ],
    "instructions": [
      "Make the reduced strawberry puree first, and let cool: Puree 1 pound of rinsed and hulled strawberries. You should have a little over 1 cup. Stirring occasionally, simmer the puree over medium-low heat until you’re left with 1/2 cup or slightly more (you need 1/2 cup for the cake). This takes at least 25–35 minutes, but could take longer depending on your pan or how juicy your strawberries were. Allow to cool completely before using in cake batter. I always make the reduced puree the day before so it has plenty of time to cool down. I cover and place in the refrigerator overnight. Allow it to come back to room temperature before adding to the cake batter. (See Notes for further make-ahead instructions.)",
      "Preheat oven to 350°F (177°C). Grease two 9-inch round cake pans, line with parchment paper rounds, then grease the parchment paper. Parchment paper helps the cakes seamlessly release from the pans. (If it’s helpful, see this parchment paper rounds for cakes video & post.)",
      "Make the cake: Whisk the cake flour, baking powder, baking soda, and salt together. Set aside.",
      "Using a handheld or stand mixer fitted with a paddle attachment, beat the butter and sugar together on high speed until smooth and creamed, about 2 minutes. Scrape down the sides and up the bottom of the bowl with a rubber spatula as needed. Beat in the egg whites on high speed until combined, about 2 minutes. Then beat in the sour cream and vanilla extract. Scrape down the sides and up the bottom of the bowl as needed. With the mixer on low speed, add the dry ingredients until just incorporated. With the mixer still running on low, slowly pour in the milk *just* until combined. Do not overmix. Whisk in 1/2 cup of room-temperature reduced strawberry puree, making sure there are no lumps at the bottom of the bowl. The batter will be slightly thick. Stir in food coloring, if desired. (I use 1 small drop of pink gel food coloring.)",
      "Pour batter evenly into cake pans. Bake for around 24–25 minutes or until the cakes are baked through. To test for doneness, insert a toothpick into the center of the cake. If it comes out clean, it is done. Allow cakes to cool completely in the pans set on a wire rack. The cakes must be completely cool before frosting and assembling.",
      "Make the frosting: Using a blender or food processor, process the freeze-dried strawberries into a powdery crumb. You should have around 1/2 cup crumbs. Set aside. In a large bowl using a hand-held or stand mixer fitted with a paddle or whisk attachment, beat the cream cheese for 1 minute on high speed until completely smooth and creamy. Beat in the butter until combined. Add the confectioners’ sugar, strawberry powder, 1 Tablespoon milk, and vanilla and beat on medium-high speed until combined and creamy. Add 1 more Tablespoon of milk to slightly thin out, if desired. Taste, then add a pinch of salt if needed. Yields about 3 cups of frosting.",
      "Assemble and frost: First, using a large serrated knife, slice a thin layer off the tops of the cakes to create a flat surface. Discard (or crumble over ice cream!). Place 1 cake layer on your cake stand or serving plate. Evenly cover the top with frosting. Top with 2nd layer and spread the remaining frosting all over the top and sides. Refrigerate for at least 45 minutes before slicing. This helps the cake keep its shape when cutting—it could slightly fall apart without time in the fridge.",
      "Cover leftover cake tightly and store in the refrigerator for 5 days."
    ],
    "notes": [
      "Make Ahead Instructions: The cake layers can be baked, cooled, and covered tightly and stored at room temperature overnight. Likewise, the frosting can be prepared, then covered and refrigerated overnight. Let it sit at room temperature to slightly soften for 10 minutes before assembling and frosting. Frosted cake or unfrosted cake layers can be frozen for up to 2–3 months. Thaw overnight in the refrigerator and bring to room temperature before decorating/serving. See How to Freeze Cakes for instructions. You can also make the reduced strawberry puree ahead of time and store it covered in the refrigerator for up to 3 days, or freeze it for up to 3 months. Thaw, bring to room temperature, then use in the recipe.",
      "Special Tools (affiliate links): Stand Mixer or Handheld Mixer | 9-Inch Round Cake Pans | Cake Turntable | Straight Spatula for frosting | Round Cake Carrier for storage | Food Processor | Pink Food Coloring",
      "Cake Flour: I strongly suggest using cake flour in this recipe. If you can’t find it, try this homemade cake flour substitute.",
      "Whole Milk: If needed, buttermilk works in its place. I don’t recommend a lower-fat milk.",
      "Where to Buy Freeze-Dried Strawberries: I always find them in my regular grocery store in the aisle with the dried fruit. Target, Whole Foods, and Trader Joe’s carry them, and I’ve also found them in some health food stores. Do not use the chewy/gummy dried strawberries. You need FREEZE-dried strawberries, which grind into a powder. If you can’t find them anywhere, just leave them out of the frosting and add another 1/2 cup of confectioners’ sugar.",
      "Can I use frozen strawberries for the puree? You can use frozen strawberries, but they will take longer to reduce even if you thaw them first.",
      "9×13-Inch Cake: Simply pour the batter into a greased 9×13-inch pan and bake for 40 minutes or until a toothpick inserted in the center comes out clean.",
      "Cupcakes: Fill cupcake pans 2/3 full with batter. Bake for 20–22 minutes. Makes 30 cupcakes. For 14–15 cupcakes, follow my strawberry cupcakes recipe, which is adapted from this strawberry cake.",
      "Food Coloring: If you want, you can add 1–2 small drops of pink or red food coloring to deepen the pink color of the cake. I add 1 small drop of pink gel food coloring.",
      "No Cream Cheese in Frosting: If you’d like to skip the cream cheese in the frosting, use my strawberry buttercream recipe instead. You’ll have enough for a thin layer of frosting, or you can 1.5x the recipe for a thicker layer."
    ]
  },
  {
    "title": "Quick & Easy Banana Muffins",
    "slug": "banana-muffins",
    "rating": 4.9,
    "num_reviews": 1568,
    "link": "https://sallysbakingaddiction.com/banana-muffins/",
    "images": [
      "https://sallysbakingaddiction.com/wp-content/uploads/2018/12/banana-muffins-recipe-2.jpg",
      "https://sallysbakingaddiction.com/wp-content/uploads/2018/12/banana-muffins-recipe-3.jpg",
      "https://sallysbakingaddiction.com/wp-content/uploads/2018/12/banana-muffins-recipe-5.jpg",
      "https://sallysbakingaddiction.com/wp-content/uploads/2018/12/banana-muffin-batter.jpg",
      "https://sallysbakingaddiction.com/wp-content/uploads/2018/12/banana-muffins-recipe-4.jpg",
      "https://sallysbakingaddiction.com/wp-content/uploads/2019/01/banana-muffins-chocolate-ganache.jpg",
      "https://sallysbakingaddiction.com/wp-content/uploads/2019/01/best-banana-muffins.jpg",
      "https://sallysbakingaddiction.com/wp-content/uploads/2018/12/banana-muffins-recipe-2-265x265.jpg"
    ],
    "prep_time": "10 minutes",
    "cook_time": "20 minutes",
    "total_time": "30 minutes",
    "serves": "10-12 muffins",
    "description": "These banana muffins are soft, buttery, and spiced with cinnamon. They’re wonderful plain, but taste fantastic with 1 cup chopped walnuts or chocolate chips. You need 3 ripe bananas and a handful of basic kitchen ingredients.",
    "ingredients": [
      "1 and 1/2 cups (188g) all-purpose flour (spooned & leveled)",
      "1 teaspoon baking powder",
      "1 teaspoon baking soda",
      "1/2 teaspoon salt",
      "1 teaspoon ground cinnamon",
      "1/4 teaspoon ground nutmeg",
      "1 and 1/2 cups (345g) mashed bananas (about 4 medium or 3 large ripe bananas)",
      "6 Tablespoons (85g) unsalted butter, melted (or melted coconut oil)",
      "2/3 cup (135g) packed light or dark brown sugar (or coconut sugar)*",
      "1 large egg, at room temperature",
      "1 teaspoon pure vanilla extract",
      "2 Tablespoons (30ml) milk*",
      "optional: 1 cup chopped walnuts, pecans, or chocolate chips"
    ],
    "instructions": [
      "Preheat oven to 425°F (218°C). Spray a 12-count muffin pan with nonstick spray or use cupcake liners.",
      "Whisk the flour, baking powder, baking soda, salt, cinnamon, and nutmeg together in a medium bowl. Set aside. In a large bowl or in the bowl of your stand mixer, mash the bananas. On medium speed, beat or whisk in the melted butter, brown sugar, egg, vanilla extract, and milk. Pour the dry ingredients into the wet ingredients, then beat or whisk until combined. If adding nuts or chocolate chips, fold them in now. Batter will be thick.",
      "Spoon the batter into liners, filling them all the way to the top. Bake for 5 minutes at 425°F, then, keeping the muffins in the oven, reduce the oven temperature to 350°F (177°C). Bake for an additional 16–18 minutes or until a toothpick inserted in the center comes out clean. The total time these muffins take in the oven is about 21–23 minutes, give or take. (For mini muffins, bake 12–14 total minutes at 350°F (177°C).) Allow the muffins to cool for 5 minutes in the muffin pan, then transfer to a wire rack to continue cooling.",
      "Muffins stay fresh covered at room temperature for a few days or in the refrigerator for up to 1 week."
    ],
    "notes": [
      "Make Ahead Instructions: For longer storage, freeze muffins for up to 3 months. Thaw overnight in the refrigerator, then bring to room temperature or warm up in the microwave if desired.",
      "Special Tools (affiliate links): Stand Mixer or Handheld Mixer | Glass Mixing Bowls | Whisk | 12-Count Muffin Pan | Muffin Liners",
      "Why the initial high temperature? The hot burst of air will spring up the top of the muffin quickly, then the inside of the muffin can bake for the remainder of the time. This helps the muffins rise nice and tall.",
      "Whole Wheat Flour: Feel free to substitute whole wheat flour for all-purpose flour or use a mix of both as long as you use 1 and 1/2 cups total. If using all whole wheat flour, add another Tablespoon (15ml) of milk.",
      "Frozen Bananas: You can use frozen bananas here. Thaw the frozen bananas. Drain off any excess liquid, mash, then use as instructed in the recipe. See How to Freeze & Thaw Bananas for Baking.",
      "Sugar: You can use 2/3 cup of packed brown sugar or coconut sugar. Or a mixture of these to yield 2/3 cup. If using 2/3 cup coconut sugar, the muffins won’t be as sweet. I find they taste best with 2/3 cup brown sugar or 1/3 cup of each. 2/3 cup of honey or pure maple syrup works too, though the muffins will taste a little more moist in the centers. I’m unsure about sugar substitutes, but let me know if you try any.",
      "Milk: Use your favorite variety of dairy or nondairy milk.",
      "Banana Bread: Here’s my favorite banana bread recipe. 🙂"
    ]
  },
  {
    "title": "My Favorite Banana Bread",
    "slug": "best-banana-bread-recipe",
    "rating": 4.8,
    "num_reviews": 1225,
    "link": "https://sallysbakingaddiction.com/best-banana-bread-recipe/",
    "images": [
      "https://sallysbakingaddiction.com/wp-content/uploads/2018/10/moist-banana-bread.jpg",
      "https://sallysbakingaddiction.com/wp-content/uploads/2018/10/homemade-banana-bread.jpg",
      "https://sallysbakingaddiction.com/wp-content/uploads/2013/05/best-easy-banana-bread-recipe-7.jpg",
      "https://sallysbakingaddiction.com/wp-content/uploads/2018/10/bananas-butter-eggs-sour-cream-brown-sugar-and-other-ingredients.jpg",
      "https://sallysbakingaddiction.com/wp-content/uploads/2018/10/banana-bread-batter.jpg",
      "https://sallysbakingaddiction.com/wp-content/uploads/2018/10/homemade-banana-bread-2.jpg",
      "https://sallysbakingaddiction.com/wp-content/uploads/2013/05/banana-bread-recipe-4.jpg",
      "https://sallysbakingaddiction.com/wp-content/uploads/2018/10/moist-banana-bread-265x265.jpg"
    ],
    "prep_time": "10 minutes",
    "cook_time": "65 minutes",
    "total_time": "3 hours",
    "serves": "1 loaf",
    "description": "With its super-moist and buttery texture, banana and brown sugar flavors, soft crumb, and 1,000+ reviews, this is a delicious AND undeniably popular banana bread recipe. You need 4 large ripe bananas.",
    "ingredients": [
      "2 cups (250g) all-purpose flour (spooned & leveled)",
      "1 teaspoon baking soda",
      "1/4 teaspoon salt",
      "1/2 teaspoon ground cinnamon",
      "1/2 cup (8 Tbsp; 113g) unsalted butter, softened to room temperature",
      "3/4 cup (150g) packed light or dark brown sugar",
      "2 large eggs, at room temperature",
      "1/3 cup (80g) plain yogurt or sour cream, at room temperature",
      "2 cups (460g) mashed bananas (about 4 large ripe bananas)",
      "1 teaspoon pure vanilla extract",
      "optional: 3/4 cup (100g) chopped pecans or walnuts"
    ],
    "instructions": [
      "Adjust the oven rack to the lower third position and preheat the oven to 350°F (177°C). Lowering the oven rack prevents the top of your bread from browning too much, too soon. Grease a metal 9×5-inch loaf pan with nonstick spray. Set aside.",
      "Whisk the flour, baking soda, salt, and cinnamon together in a medium bowl. Set aside.",
      "Using a handheld or stand mixer fitted with a paddle or whisk attachment, beat the butter and brown sugar together on high speed until smooth and creamy, about 2 minutes. With the mixer running on medium speed, add the eggs one at a time, beating well after each addition. Then beat in the yogurt, mashed bananas, and vanilla extract until combined.",
      "With the mixer running on low speed, slowly beat the dry ingredients into the wet ingredients until no flour pockets remain. Do not over-mix. Fold in the nuts, if using.",
      "Pour and spread the batter into the prepared baking pan. Bake for 60–65 minutes, making sure to loosely cover the bread with aluminum foil halfway through to prevent the top from getting too brown. The bread is done when a toothpick inserted in the center comes out clean with only a few small moist crumbs. This may be after 60–65 minutes depending on your oven, so begin checking every 5 minutes around the 60-minute mark.",
      "Remove bread from the oven and allow the bread to cool in the pan set on a wire rack for 1 hour. Remove bread from the pan and cool bread directly on the wire rack until ready to slice and serve.",
      "Cover and store banana bread at room temperature for 2 days or in the refrigerator for up to 1 week. Banana bread tastes best on day 2 after the flavors have settled together. See post above for freezing instructions."
    ],
    "notes": [
      "Special Tools (affiliate links): 9×5-inch Loaf Pan | Electric Mixer (Handheld or Stand) | Glass Mixing Bowls | Whisk | Silicone Spatula | Cooling Rack",
      "Butter: If needed, you can use salted butter in this recipe with no other changes needed. I’ve also successfully reduced the butter down to 6 Tablespoons (85g) with no issue (just as tasty).",
      "Brown Sugar: This is not an overly sweet quick bread. If you want a sweeter banana bread, increase to 1 cup (200g) brown sugar. Feel free to replace some or all of the brown sugar with regular white granulated sugar.",
      "Cream Cheese Frosting: This banana bread also tastes fantastic with cream cheese frosting on top! To make it, beat 4 ounces (112g) of softened cream cheese and 1/4 cup (60g) of softened unsalted butter together on medium speed until smooth. Beat in 1 cup (120g) of confectioners sugar, 1/2 teaspoon of pure vanilla extract, and a pinch of salt until combined. Spread on cooled loaf.",
      "Banana Bread Muffins: Use this banana bread recipe to make 15 banana bread muffins. Spoon the batter into a lined or greased muffin pan (fill each to the top with batter) and bake for 5 minutes at 425°F (218°C); then, keeping the muffins in the oven, reduce the oven temperature to 350°F (177°C). Bake for an additional 16–17 minutes or until a toothpick inserted in the center comes out clean. The total bake time for the banana bread muffins is about 21–23 minutes. The initial burst of hot air helps those muffins rise nice and tall! Or try my quick & easy banana muffins.",
      "Brown Sugar: Feel free to substitute the same amount of regular white granulated sugar or coconut sugar. I do not recommend any liquid sweeteners.",
      "No Sour Cream or Yogurt? Feel free to use 1/3 cup mashed banana (in addition to the 2 cups), unsweetened applesauce, or even canned pumpkin puree.",
      "Frozen Bananas: You can use frozen bananas here. Thaw the frozen bananas. Drain off any excess liquid, mash, then use as instructed in the recipe. See How to Freeze & Thaw Bananas for Baking. Try not to mash too much or else you’ll be left with 2 cups of banana-y liquid; some chunks are great.",
      "Chocolate Chips: I love this bread with chocolate chips, too. Feel free to add 1 cup of your favorite chocolate chips. No need to leave out the nuts if you add the chocolate chips. Chocolate chips and nuts are both optional.",
      "Can I Turn This Into Banana Bundt Cake? There isn’t enough batter. I recommend using my extremely similar, scaled-up recipe for chocolate marble banana Bundt cake instead. You can leave out the chocolate swirl in that recipe."
    ]
  },
  {
    "title": "Lemon Bars",
    "slug": "lemon-bars-recipe",
    "rating": 4.7,
    "num_reviews": 1021,
    "link": "https://sallysbakingaddiction.com/lemon-bars-recipe/",
    "images": [
      "https://sallysbakingaddiction.com/wp-content/uploads/2019/02/lemon-bars-2.jpg",
      "https://sallysbakingaddiction.com/wp-content/uploads/2019/02/lemon-bars.jpg",
      "https://sallysbakingaddiction.com/wp-content/uploads/2019/02/how-to-make-lemon-bars.jpg",
      "https://sallysbakingaddiction.com/wp-content/uploads/2019/02/lemon-bars-1.jpg",
      "https://sallysbakingaddiction.com/wp-content/uploads/2019/02/lemon-bars-3.jpg",
      "https://sallysbakingaddiction.com/wp-content/uploads/2019/02/blood-orange-bars.jpg",
      "https://sallysbakingaddiction.com/wp-content/uploads/2019/02/lemon-bars-on-shortbread-crust-2-265x265.jpg",
      "https://sallysbakingaddiction.com/wp-content/uploads/2019/02/lemon-bars-on-shortbread-crust.jpg"
    ],
    "prep_time": "10 minutes",
    "cook_time": "40 minutes",
    "total_time": "3 hours, 50 minutes",
    "serves": "24 bars",
    "description": "You only need 7 ingredients to make these lemon bars. The lemon curd filling is extra thick and creamy and sits on an irresistible butter shortbread crust. Always bake lemon bars at a lower temperature to avoid over-baking. See recipe notes for important tips. They’re simply the best lemon bars and are perfect for picnics, bake sales, spring brunches, baby showers, and bridal showers.",
    "ingredients": [
      "1 cup (230g; 2 sticks) unsalted butter, melted",
      "1/2 cup (100g) granulated sugar",
      "2 teaspoons pure vanilla extract",
      "1/2 teaspoon salt",
      "2 cups + 2 Tablespoons (265g) all-purpose flour (spooned & leveled)",
      "2 cups (400g) granulated sugar",
      "6 Tablespoons (46g) all-purpose flour",
      "6 large eggs",
      "1 cup (240ml) lemon juice (about 4 lemons)",
      "optional: confectioners’ sugar for dusting"
    ],
    "instructions": [
      "Preheat the oven to 325°F (163°C). Line the bottom and sides of a 9×13 glass baking pan (do not use metal) with parchment paper, leaving an overhang on the sides to lift the finished bars out (makes cutting easier!). Set aside.",
      "Make the crust: Mix the melted butter, sugar, vanilla extract, and salt together in a medium bowl. Add the flour and stir to completely combine. The dough will be thick. Press firmly into prepared pan, making sure the layer of crust is nice and even. Bake for 20-22 minutes or until the edges are lightly browned. Remove from the oven. Using a fork, poke holes all over the top of the warm crust (not all the way through the crust). A new step I swear by, this helps the filling stick and holds the crust in place. Set aside until step 4.",
      "Make the filling: Sift the sugar and flour together in a large bowl. Whisk in the eggs, then the lemon juice until completely combined.",
      "Pour filling over warm crust. Bake the bars for 22-26 minutes or until the center is relatively set and no longer jiggles. (Give the pan a light tap with an oven mitt to test.) Remove bars from the oven and cool completely at room temperature. I usually cool them for about 2 hours at room temperature, then stick in the refrigerator for 1-2 more hours until pretty chilled. I recommend serving chilled.",
      "Once cool, lift the parchment paper out of the pan using the overhang on the sides. Dust with confectioners’ sugar and cut into squares before serving. For neat squares, wipe the knife clean between each cut. Cover and store leftover lemon bars in the refrigerator for up to 1 week.",
      "Freezing Instructions: Lemon bars can be frozen for up to 3-4 months. Cut the cooled bars (without confectioners’ sugar topping) into squares, then place onto a baking sheet. Freeze for 1 hour. Individually wrap each bar in aluminum foil or plastic wrap and place into a large bag or freezer container to freeze. Thaw in the refrigerator, then dust with confectioners’ sugar before serving."
    ],
    "notes": [
      "Special Tools (affiliate links): 9×13-Inch Glass Pan | Glass Mixing Bowls | Spatula | Silicone Whisk | Juicer | Fine Mesh Sieve",
      "Halve the Recipe: Halve each of the ingredients to yield around 12 squares in a 9×9-inch baking pan. Same oven temperature. Bake the crust for 16-18 minutes and the bars for 20 minutes or until the center no longer jiggles.",
      "Sifting: More often than not, the flour doesn’t fully incorporate into the lemon filling unless it’s sifted with the sugar. As directed in the recipe, sift the two together before adding the eggs and lemon juice. I don’t always do this (and didn’t even do it in the video above!) but it’s preferred to avoid any flour lumps. If you have a sifter, it’s worth using. If you forget, it’s not a huge deal. Here is my favorite sifter. You use it again to dust the lemon bars with confectioners’ sugar.",
      "Lemon Juice: For exceptional taste, I highly recommend fresh lemon juice. Here is a wonderful inexpensive juicer if you don’t have one. Or use another fresh-squeezed citrus like grapefruit, blood orange, lime, or regular orange. You can slightly reduce the sugar if using a sweeter citrus. I recommend no less than 1 and 2/3 cup granulated sugar in the filling as it’s needed for structure.",
      "Room Temperature: Bringing the eggs and lemon juice to room temperature helps them mix easier into the flour and sugar. However, I never notice a taste or texture difference when using cold. Room temperature or cold, use whichever!"
    ]
  },
  {
    "title": "Easy Homemade Pizza Dough",
    "slug": "homemade-pizza-crust-recipe",
    "rating": 4.9,
    "num_reviews": 760,
    "link": "https://sallysbakingaddiction.com/homemade-pizza-crust-recipe/",
    "images": [
      "https://sallysbakingaddiction.com/wp-content/uploads/2019/01/homemade-pizza-dough.jpg",
      "https://sallysbakingaddiction.com/wp-content/uploads/2019/01/homemade-pizza-dough-2.jpg",
      "https://sallysbakingaddiction.com/wp-content/uploads/2019/01/homemade-pizza-dough-4.jpg",
      "https://sallysbakingaddiction.com/wp-content/uploads/2019/01/pizza-dough-with-toppings.jpg",
      "https://sallysbakingaddiction.com/wp-content/uploads/2019/01/homemade-pizza-dough-3.jpg",
      "https://sallysbakingaddiction.com/wp-content/uploads/2022/08/basil-pesto-pizza.jpg",
      "https://sallysbakingaddiction.com/wp-content/uploads/2019/01/homemade-pizza-dough-2-265x265.jpg"
    ],
    "prep_time": "2 hours, 15 minutes",
    "cook_time": "15 minutes",
    "total_time": "2 hours, 30 minutes",
    "serves": "2 12-inch pizzas",
    "description": "Follow these basic instructions for a thick, crisp, and chewy pizza crust at home. The recipe yields enough pizza dough for two 12-inch pizzas and you can freeze half of the dough for later. Close to 2 pounds of dough total.",
    "ingredients": [
      "1 and 1/3 cups (320ml) warm water (between 100-110°F, 38-43°C)",
      "2 and 1/4 teaspoons (7g) Platinum Yeast from Red Star instant yeast (1 standard packet)*",
      "1 Tablespoon (13g) granulated sugar",
      "2 Tablespoons (30ml) olive oil, plus more for pan and brushing on dough",
      "1 teaspoon salt",
      "3 and 1/2 cups (about 450g) unbleached all-purpose flour (spooned & leveled), plus more for hands and surface",
      "sprinkle of cornmeal for dusting the pan"
    ],
    "instructions": [
      "Whisk the warm water, yeast, and granulated sugar together in the bowl of your stand mixer fitted with a dough hook or paddle attachment. Cover and allow to rest for 5 minutes. *If you don’t have a stand mixer, simply use a large mixing bowl and mix the dough with a wooden spoon or rubber spatula in the next step.",
      "Add the olive oil, salt, and flour. Beat on low speed for 2 minutes. Turn the dough out onto a lightly floured surface. With lightly floured hands, knead the dough for 5 minutes (for a visual, watch me do it in the video above). The dough can be a little too heavy for a mixer to knead it, but you can certainly use the mixer on low speed instead. After kneading, the dough should still feel a little soft. Poke it with your finger – if it slowly bounces back, your dough is ready to rise. If not, keep kneading.",
      "Lightly grease a large bowl with oil or nonstick spray– just use the same bowl you used for the dough. Place the dough in the bowl, turning it to coat all sides in the oil. Cover the bowl with aluminum foil, plastic wrap, or a clean kitchen towel. Allow the dough to rise at room temperature for 60-90 minutes or until double in size. (Tip: For the warm environment on a particularly cold day, heat your oven to 150°F (66°C). Turn the oven off, place the dough inside, and keep the door slightly ajar. This will be a warm environment for your dough to rise. After about 30 minutes, close the oven door to trap the air inside with the rising dough. When it’s doubled in size, remove from the oven.)",
      "Preheat oven to 475°F (246°C). Allow it to heat for at least 15-20 minutes as you shape the pizza. (If using a pizza stone, place it in the oven to preheat as well.) Lightly grease baking sheet or pizza pan with nonstick spray or olive oil. Sprinkle lightly with cornmeal, which gives the crust extra crunch and flavor.",
      "Shape the dough: When the dough is ready, punch it down to release any air bubbles. Divide the dough in half. (If not making 2 pizzas, freeze half of the dough for another time. See freezing instructions below.) On a lightly floured work surface using lightly floured hands or rolling pin, gently flatten the dough into a disc. Place on prepared pan and, using lightly floured hands, stretch and flatten the disc into a 12-inch circle, about 1/2-inch thick. If the dough keeps shrinking back as you try to stretch it, stop what you’re doing, cover it lightly for 5-10 minutes, then try again. Once shaped into a 12-inch circle, lift the edge of the dough up to create a lip around the edges. I simply pinch the edges up to create the rim. If using a pizza stone, place the dough directly on baker’s peels dusted with cornmeal.",
      "Cover dough lightly with plastic wrap or a clean kitchen towel and allow to rest for a few minutes as you prepare your pizza toppings. I suggest pepperoni & green peppers or jalapeño slices, extra cheese pizza, Hawaiian pizza, pesto pizza, spinach artichoke white pizza, or homemade BBQ chicken pizza.",
      "Top & bake the pizza: Using your fingers, push dents into the surface of the dough to prevent bubbling. To prevent the filling from making your pizza crust soggy, brush the top lightly with olive oil. Top with your favorite toppings and bake for 13-15 minutes or until the crust is golden brown.",
      "Slice hot pizza and serve immediately. Cover leftover pizza tightly and store in the refrigerator. Reheat as you prefer. Baked pizza slices can be frozen up to 3 months."
    ],
    "notes": [
      "Freezing Instructions: This recipe yields enough dough for two 12-inch pizzas, a little less than 2 pounds total. After the pizza dough rises and you divide the dough in half (step 5), you can freeze one of the balls of dough to make pizza at a later time. Or you can simply freeze both balls of dough separately. Lightly coat all sides of the dough ball(s) with nonstick spray or olive oil. Place the dough ball(s) into individual zipped-top bag(s) and seal tightly, squeezing out all the air. Freeze for up to 3 months. To thaw, place the frozen pizza dough in the refrigerator for about 8 hours or overnight. When ready to make pizza, remove the dough from the refrigerator and allow to rest for 1 hour on the counter. Preheat the oven and continue with step 5, punching down the dough to release air if needed.",
      "Overnight/All Day Instructions: Prepare the dough through step 3, but allow the dough to rise for 8-12 hours in the refrigerator. (If it needs to be in the refrigerator for longer, use cooler water in the dough which will slow the dough’s rise and allow for more time.) The slow rise gives the pizza dough wonderful flavor! When ready, continue with step 4. If the dough didn’t quite double in size overnight, let it sit at room temperature for 30-45 minutes before punching down (step 5).",
      "Special Tools (affiliate links): Stand Mixer | Dough Scraper | Pizza Pan | Pastry Brush | Pizza Cutter",
      "Yeast: Red Star Platinum yeast is an instant yeast. You can use active dry yeast instead. The rise time will be at least 90 minutes. Reference my Baking with Yeast Guide for answers to common yeast FAQs.",
      "Pictured Pizza: This recipe yields 2 pizzas. For each, top with 1/2 cup pizza sauce, 2 cups shredded mozzarella cheese, pepperoni slices, thinly sliced green pepper or jalapeño, and a sprinkle of Italian seasoning blend or dried basil."
    ]
  }
]